In [6]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [4]:
#outside

In [ ]:
#inside

In [ ]:
#list(zip(outside,inside))

In [ ]:
#hier_index

In [8]:
import numpy as np
import pandas as pd
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [9]:
df

             A         B
G1 1  0.020293 -0.324767
   2 -0.381742  1.090100
   3 -1.172329 -0.064550
G2 1  1.152863  0.176314
   2  1.646728  1.110368
   3 -0.090041  0.878466

In [13]:
import numpy as np
import pandas as pd
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.170321  1.632655
   2  0.284878  0.112868
   3 -1.951348 -0.544619
G2 1 -0.363543  0.045775
   2 -1.782957  0.827983
   3  0.267196  0.122616

In [15]:
df.loc['G1']

          A         B
1  1.170321  1.632655
2  0.284878  0.112868
3 -1.951348 -0.544619

In [18]:
df.loc['G1'].loc[1]

A    1.170321
B    1.632655
Name: 1, dtype: float64

In [24]:
df.index.names=['Groups','Num']

In [25]:
df

                   A         B
Groups Num
G1     1    1.170321  1.632655
       2    0.284878  0.112868
       3   -1.951348 -0.544619
G2     1   -0.363543  0.045775
       2   -1.782957  0.827983
       3    0.267196  0.122616

In [26]:
df.loc['G2'].loc[1]['B']

0.045774672042148946

In [27]:
df.loc['G1']

            A         B
Num
1    1.170321  1.632655
2    0.284878  0.112868
3   -1.951348 -0.544619

In [33]:
df.xs('G1').xs(1).xs('A')

1.1703206930433894

In [37]:
df.xs(1,level='Num')

               A         B
Groups
G1      1.170321  1.632655
G2     -0.363543  0.045775

In [2]:
import numpy as np
import pandas as pd

In [3]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.fillna(value='New Value')

           A          B  C
0        1.0        5.0  1
1        2.0  New Value  2
2  New Value  New Value  3

In [19]:
new_df=df['A'].fillna(value=df['A'].mean())
new_df

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
 df['A']=new_df

In [22]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [23]:
new_df1=df['B'].fillna(value=df['B'].mean())
new_df1

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [24]:
 df['B']=new_df1

In [25]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [26]:
import numpy as np
import pandas as pd

In [28]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['SAM','CHARLIE','AMY','VANESSA','CARL','SARA'],
     'Sales':[200,120,340,124,243,350]}

In [29]:
df=pd.DataFrame(data)

In [30]:
df

  Company   Person  Sales
0    GOOG      SAM    200
1    GOOG  CHARLIE    120
2    MSFT      AMY    340
3    MSFT  VANESSA    124
4      FB     CARL    243
5      FB     SARA    350

In [32]:
byComp=df.groupby('Company')

In [33]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [34]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [35]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [36]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [37]:
dfgroupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [38]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [40]:
df.groupby('Company').min()

          Person  Sales
Company
FB          CARL    243
GOOG     CHARLIE    120
MSFT         AMY    124

In [43]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [44]:
import pandas as pd

In [54]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                'B':['B0','B1','B2','B3'],
                'C':['C0','C1','C2','C3'],
                'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])

In [55]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                'B':['B4','B5','B6','B7'],
                'C':['C4','C5','C6','C7'],
                'D':['D4','D5','D6','D7']},
                index=[4,5,6,7])

In [49]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                'B':['B8','B9','B10','B11'],
                'C':['C8','C9','C10','C11'],
                'D':['D8','D9','D10','D11']},
                index=[8,9,10,11])

In [56]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [57]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [58]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [60]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [65]:
pd1=pd.merge(df1,df2,how='inner',on='B')

In [67]:
pd1

Empty DataFrame
Columns: [A_x, B, C_x, D_x, A_y, C_y, D_y]
Index: []

In [68]:
left=pd.DataFrame({'key1':['k0','k0','k1','k2'],
                   'key2':['k0','k1','k0','k1'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

In [74]:
right=pd.DataFrame({'key1':['k0','k1','k1','k2'],
                   'key2':['k0','k0','k0','k0'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})

In [75]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [76]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [77]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k1   A3   B3  NaN  NaN
5   k2   k0  NaN  NaN   C3   D3

In [78]:
pd.merge(left,right,on=['key1'])

  key1 key2_x   A   B key2_y   C   D
0   k0     k0  A0  B0     k0  C0  D0
1   k0     k1  A1  B1     k0  C0  D0
2   k1     k0  A2  B2     k0  C1  D1
3   k1     k0  A2  B2     k0  C2  D2
4   k2     k1  A3  B3     k0  C3  D3

In [95]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                   index=['k0','k1','k2','k3'])

In [94]:
right=pd.DataFrame({'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                  index=['k0','k3','k4','k5'])

In [96]:
left.join(right)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2  NaN  NaN
k3  A3  B3   C1   D1

In [97]:
left.join(right,how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2  NaN  NaN
k3   A3   B3   C1   D1
k4  NaN  NaN   C2   D2
k5  NaN  NaN   C3   D3

In [98]:
left.join(right,how='inner')

     A   B   C   D
k0  A0  B0  C0  D0
k3  A3  B3  C1  D1